# DuplicateConstruction Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSpaceConstruction..::..DuplicateConstruction Method
MEPSpaceConstruction Class See Also
---
Create a new construction for Space constructions.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MEPBuildingConstruction DuplicateConstruction(
	MEPBuildingConstruction pCurrentConstruction,
	string pName
)
```

Visual Basic
---
```text
Public Function DuplicateConstruction ( _
	pCurrentConstruction As MEPBuildingConstruction, _
	pName As String _
) As MEPBuildingConstruction
```

Visual C++
---
```text
public:
MEPBuildingConstruction^ DuplicateConstruction(
	MEPBuildingConstruction^ pCurrentConstruction,
	String^ pName
)
```

# ### Parameters
pCurrentConstruction
    Type: Autodesk.Revit.DB.Mechanical..::..MEPBuildingConstructionThe existing construction to be duplicated.
pName
    Type: System..::..StringThe name of the new construction.
# Remarks
If the name is same with the existing one, an exception will be thrown.
# See Also
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace